// Lab_03_1.cpp
// ×èï³ã³íà Àíàñòàñ³ÿ
// Ëàáîðàòîðíà ðîáîòà ¹ 3.1
// Ðîçãàëóæåííÿ, çàäàíå ôîðìóëîþ: ôóíêö³ÿ îäí³º¿ çì³ííî¿.
// Âàð³àíò 23

#include <iostream>
#include <cmath>

using namespace std;


int main()
{
	double x; // âõ³äíèé ïàðàìåòð
	double y; // ðåçóëüòàò îá÷èñëåííÿ âèðàçó
	double A; // ïðîì³æíèé ðåçóëüòàò - ôóíêö³îíàëüíî ñòàëà ÷àñòèíà âèðàçó
	double B; // ïðîì³æíèé ðåçóëüòàò - ôóíêö³îíàëüíî çì³ííà ÷àñòèíà âèðàçó

	cout << "x = "; cin >> x;

	A = x * x + sin((4*x)/3);

	// ñïîñ³á 1: ðîçãàëóæåííÿ â ñêîðî÷åí³é ôîðì³
	if (x < -5)
		B = cos(x)/sin(x);
	if (-5 <= x && x <= 0)
		B = 4 - (x * x)/2;
	if (x > 0)
		B = log10(x * x) - (4 * x) / 3;

	y = A + B;

	cout << endl;
	cout << "1) y = " << y << endl;


	// ñïîñ³á 1: ðîçãàëóæåííÿ â ñêîðî÷åí³é ôîðì³
	if (x < -5)
		B = cos(x) / sin(x);
	else
		if (x > 0)
			B = log10(x * x) - (4 * x) / 3;
		else
			B = 4 - (x * x) / 2;

	y = A + B;

	cout << "2) y = " << y << endl;

	system("pause");
	return 0;
}
